davidanson.vscode-markdownlint
eamodio.gitlens
golang.go
google.gemini-cli-vscode-ide-companion
grapecity.gc-excelviewer
jlcodes.antigravity-cockpit
llvm-vs-code-extensions.vscode-clangd
mechatroner.rainbow-csv
meta.pyrefly
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-ceintl.vscode-language-pack-zh-hant
ms-python.debugpy
ms-python.python
ms-python.vscode-python-envs
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
shopify.ruby-lsp
